# Stepick.org — Python | Вторая ступень | Продвинутые концепции
# 2.  Списки | Тип данных - list
# 2.4 Генераторы списков | [i for i in ...]

import pytest
from src.module_2 import m_2_4_1, m_2_4_2, m_2_4_3, m_2_4_4

# для запуска pytest -k "test_2_4_" -q -x --tb=short


# === Тест к задаче 1 ===


def test_2_4_1():
    expected = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
    result = m_2_4_1()
    assert result == expected


# === Тест к задаче 2 ===


@pytest.mark.parametrize(
    "num, expected",
    [
        (3, [0, 2]),  # пример из задания
        (0, [0]),  # граничное значение — ноль
        (1, [0]),  # только 0 — единственное чётное
        (2, [0, 2]),  # маленький чётный диапазон
        (5, [0, 2, 4]),  # нечётный предел
        (10, [0, 2, 4, 6, 8, 10]),  # стандартная проверка
    ],
)
def test_2_4_2(num, expected):
    assert m_2_4_2(num) == expected


# === Тест к задаче 3 ===


@pytest.mark.parametrize(
    "num, expected",
    [
        (5, [1, 4, 9, 16, 25]),  # пример из задания
        (1, [1]),  # минимальное значение
        (0, []),  # граничный случай — нет чисел
        (3, [1, 4, 9]),  # короткая последовательность
        (10, [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]),  # стандартная проверка
    ],
)
def test_2_4_3(num, expected):
    assert m_2_4_3(num) == expected


# === Тест к задаче 4 ===


@pytest.mark.parametrize(
    "num, expected",
    [
        (6, [4, 16, 36]),  # пример из задания
        (1, []),  # нет чётных чисел
        (2, [4]),  # только одно чётное число
        (7, [4, 16, 36]),  # n нечётное
        (10, [4, 16, 36, 64, 100]),  # проверка на диапазон побольше
        (0, []),  # граничный случай
    ],
)
def test_2_4_4(num, expected):
    assert m_2_4_4(num) == expected
