# Stepick.org — Python | Вторая ступень | Продвинутые концепции
# 7. Функции | Введение в функциональное программирование

# pylint: disable=W0105

# 7.1 Введение в функции | Простые примеры

# === Задача 1 ===
"""
Напишите функцию hello(), которая выводит на экран 'Hello World!'
Снизу строки проверки функции и ее вывода уже определены в программе.
Ваша задача только реализовать саму функцию. Ниже код стирать не нужно!
"""


def hello():
    print("Hello World!")


m_5_1_1 = hello
